#include <timer.h>

 /**
 	驱动程序说明：全部1ms count++,晶振16MHz
 **/


/**************************************************************
 隶属模块：定时器测试模块
 函数名称：Timer0_Init()
 函数功能: 初始化
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
void Timer0_Init()
{
 TCNT0 = 0x83;
 TCCR0 = 0x05;//128分频
 TIMSK |= (1<<TOIE0);//使能定时器0中断 
 count0 = 0;
 flag0 = 0;
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：Timer1_Init()
 函数功能: 初始化
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
void Timer1_Init()
{
 TCNT1H = 0xFF;
 TCNT1L = 0x05;
 TCCR1A = 0x00;
 TCCR1B = 0x03;//64分频
 TIMSK |= (1<<TOIE1);//使能定时器1中断
 count1 = 0;
 flag1 = 0;
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：Timer2_Init()
 函数功能: 初始化
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
void Timer2_Init()
{
 TCNT2 = 0x06;
 TCCR2 = 0x03;//64分频
 TIMSK |= (1<<TOIE2);//使能定时器2中断
 count2 = 0;
 flag2 = 0;
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：Timer3_Init()
 函数功能: 初始化
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
void Timer3_Init()
{
 TCNT3H = 0xFF;
 TCNT3L = 0x05;
 TCCR3A = 0x00;
 TCCR3B = 0x03;//64分频
 ETIMSK |= (1<<TOIE3);//使能定时器3中断
 count3 = 0;
 flag3 = 0;
}

/**************************************************************
 隶属模块：定时器测试模块
 函数名称：SIGNAL(TIMER0_OVF_vect)
 函数功能: 定时器0中断函数,用于刷新记忆周期
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
SIGNAL(TIMER0_OVF_vect)
{
 TCNT0 = 0x83;
 if(flag0)
 	count0++;
   
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：SIGNAL(TIMER1_OVF_vect)
 函数功能: 1、定时器1中断函数 2、用来刷新传感器,更新小车朝向,发送数据给友方
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
SIGNAL (TIMER1_OVF_vect)
{
 TCNT1H = 0xFF;
 TCNT1L = 0x05;
 if(count1 >= STATECYCLE) { // count1 >= 刷新时间
 	if(count2 >= 1000) {		// 友方数据超时
		myFriend.track = 0xff;
		myFriend.detectCode = 0xff;
		myFriend.dir = 0xff;
	}
	check_sensor();			    // 刷新传感器
	updateTrack();				// 更新轨道编码
	updateDir();				// 更新小车朝向
	packData();					// 打包我方数据
	getFriendStatus();			// 获取友方状态
	statusMatch();
	count1 = 0;
 }

 count1++;
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：SIGNAL(TIMER2_OVF_vect)
 函数功能: 定时器2中断函数
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
SIGNAL (TIMER2_OVF_vect)
{

 TCNT2 = 0x06;
 if(flag2)
 	count2++; 

}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：SIGNAL(TIMER3_OVF_vect)
 函数功能: 定时器3中断函数
 入口参数: 无
 返回参数：无
 修改时间: 2011-7-16
 修改者：  陶志华
***************************************************************/
SIGNAL (TIMER3_OVF_vect)
{
 TCNT3H = 0xFF;
 TCNT3L = 0x05;
 if(flag3)
 	count3++;
}
/**************************************************************
 隶属模块：定时器测试模块
 函数名称：mytimer_init(void)
 函数功能: 初始化所有定时器
 入口参数: 无
 返回参数：无
 修改时间: 2014-7-04
 修改者：  Ting
***************************************************************/
void mytimer_init(void)
{
 Timer0_Init();
 Timer1_Init();
 Timer2_Init();
 Timer3_Init();
}


